### Terraform workspace: 4a-ofmi
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.ofmi_2024_identities.random_password.passwords["GUA2"]: Refreshing state... [id=none]
module.ofmi_2024_identities.random_password.passwords["GUA1"]: Refreshing state... [id=none]
module.ofmi_2024_identities.random_password.passwords["MEX1"]: Refreshing state... [id=none]
data.google_secret_manager_secret_version.omegaup_api_key: Reading...
data.google_secret_manager_secret_version.omegaup_api_key_juanito: Reading...
google_storage_bucket.gcs_bucket: Refreshing state... [id=4a-ofmi]
google_storage_bucket_iam_member.gcs_bucket_viewers: Refreshing state... [id=b/4a-ofmi/roles/storage.objectViewer/group:ofmi-core@omegaup.com]
data.google_secret_manager_secret_version.omegaup_api_key: Read complete after 0s [id=projects/1046639128559/secrets/OMEGAUP_API_KEY/versions/3]
data.google_secret_manager_secret_version.omegaup_api_key_juanito: Read complete after 0s [id=projects/1046639128559/secrets/OMEGAUP_API_KEY/versions/2]
omegaup_group.ofmi_2024: Refreshing state... [name=ofmi-2024]
omegaup_group_member.ofmi_2024_members["FernandoMauro"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["Josetapia"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["nbreakable"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["andreasantillana"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["Focil"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["ethanjimenez"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["Juan_Carlos_Sigler_Priego"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["charlyhlms"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["lorena_10"]: Refreshing state...
module.ofmi_2024_identities.omegaup_identities.identities: Refreshing state...
omegaup_group_member.ofmi_2024_members["Angeltapia"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["Janque"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["omibc"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["InesLlergo"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["ofmi"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["freddy"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["alo_54"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["elissabjg"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["Yosshua"]: Refreshing state...
omegaup_group_member.ofmi_2024_members["EfrenGonzalez"]: Refreshing state...
module.ofmi_2024_identities.google_storage_bucket_object.gcs_identities: Refreshing state... [id=4a-ofmi-identities.csv]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # omegaup_group.selectivo_1 will be created
  + resource "omegaup_group" "selectivo_1" {
      + alias       = "4AOFMISEL1"
      + description = "Preselectivo de la 4a OFMI"
      + name        = "4a OFMI Selectivo 1"
    }

  # module.selectivo_1_identities.google_storage_bucket_object.gcs_identities will be created
  + resource "google_storage_bucket_object" "gcs_identities" {
      + bucket         = "4a-ofmi"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "identities_selectivo.csv"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.selectivo_1_identities.omegaup_identities.identities will be created
  + resource "omegaup_identities" "identities" {
      + group_alias = "4AOFMISEL1"
      + identities  = [
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "María Fernanda López Tuyub"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "YUC"
              + username    = "4AOFMISEL1:YUC-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Yareli Guadalupe Padrón Rivera"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "GUA"
              + username    = "4AOFMISEL1:GUA-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Paula Sofia Gutierrez Calderon"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "GUA"
              + username    = "4AOFMISEL1:GUA-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Allison Avril Morales Gracian"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "SON"
              + username    = "4AOFMISEL1:SON-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Emma Sotomayor Cepeda"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MEX"
              + username    = "4AOFMISEL1:MEX-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Maria de Lourdes Vazquez Carrillo"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "YUC"
              + username    = "4AOFMISEL1:YUC-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Eva Rodríguez Muñoz"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "GUA"
              + username    = "4AOFMISEL1:GUA-3"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Mildred Ximena Lemus Barrientos"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "AGU"
              + username    = "4AOFMISEL1:AGU-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "María José Torres Guerrero"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "ROO"
              + username    = "4AOFMISEL1:ROO-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Fabiola Sacnicté Martínez Martínez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "SLP"
              + username    = "4AOFMISEL1:SLP-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Michelle Eloísa Alonso García"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "BCN"
              + username    = "4AOFMISEL1:BCN-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Cynthia Zuñiga Jimenez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Arantza Zoe Hernandez Martinez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MOR"
              + username    = "4AOFMISEL1:MOR-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Gabriela Isabel Coria Soto"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Marianne Andrea Troncoso González"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "CMX"
              + username    = "4AOFMISEL1:CMX-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Mónica Alejandra Vecino Ojeda"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "YUC"
              + username    = "4AOFMISEL1:YUC-3"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Yaretzi Natalia Ramos Carrillo"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "AGU"
              + username    = "4AOFMISEL1:AGU-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Claudia Barajas Ceja"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-3"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Yahvé Guadalupe Cruz González"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "AGU"
              + username    = "4AOFMISEL1:AGU-3"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Valeria Lizbeth Aguila Gonzalez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "SIN"
              + username    = "4AOFMISEL1:SIN-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Danna Sofía López Castro"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "SIN"
              + username    = "4AOFMISEL1:SIN-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Camila Valeria Vasquez Juarez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "CMX"
              + username    = "4AOFMISEL1:CMX-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "María Gabriela Aranda Macías"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "GUA"
              + username    = "4AOFMISEL1:GUA-4"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Luisa Mosaly Espina Lopez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "BCN"
              + username    = "4AOFMISEL1:BCN-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Emily Alejandra Hueramo Calderón"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-4"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Mayte Lozano Lozano"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "JAL"
              + username    = "4AOFMISEL1:JAL-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Anaí Hernández Peralta"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "OAX"
              + username    = "4AOFMISEL1:OAX-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Allison Yamil Castro Lopez"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-5"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Guadalupe Del Moral Gabriel"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "VER"
              + username    = "4AOFMISEL1:VER-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Sofia Andrea Navarro Rebolledo"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "PUE"
              + username    = "4AOFMISEL1:PUE-1"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Sofia Valeria López Llanes"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "ROO"
              + username    = "4AOFMISEL1:ROO-2"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Ana Carolina García Hernández"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "MIC"
              + username    = "4AOFMISEL1:MIC-6"
            },
          + {
              + country_id  = "MX"
              + gender      = "decline"
              + group_alias = (known after apply)
              + name        = "Ariadna Odeth Espitia Llamas"
              + password    = (sensitive value)
              + school_name = "OFMI"
              + state_id    = "ZAC"
              + username    = "4AOFMISEL1:ZAC-1"
            },
        ]
    }

  # module.selectivo_1_identities.random_password.passwords["AGU-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["AGU-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["AGU-3"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["BCN-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["BCN-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["CMX-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["CMX-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["GUA-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["GUA-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["GUA-3"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["GUA-4"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["JAL-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MEX-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-3"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-4"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-5"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MIC-6"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["MOR-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["OAX-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["PUE-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["ROO-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["ROO-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["SIN-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["SIN-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["SLP-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["SON-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["VER-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["YUC-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["YUC-2"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["YUC-3"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.selectivo_1_identities.random_password.passwords["ZAC-1"] will be created
  + resource "random_password" "passwords" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "seed" = "seed"
        }
      + length           = 12
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "@#-!"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 36 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @andreasantillana, Action: `pull_request`*